//---------------------------------------------
// Quick Watch Window
//---------------------------------------------

// نافذة Quick Watch تُستخدم لفحص قيمة متغير
// أو Expression معين أثناء الـ Debugging.

// تُستخدم للفحص المؤقت (مرة واحدة)
// بعكس Watch Window المستخدمة للمراقبة المستمرة.

// ماذا يمكننا أن نفعل بها؟

// 1- فحص قيمة متغير
// مثال:
// int x = 5;
// يمكن معرفة قيمة x مباشرة.

// 2- اختبار Expression
// مثال:
// x + 10
// ستظهر النتيجة: 15

// 3- فحص Arrays أو Pointers أو Objects
// ويمكن توسيعها لرؤية التفاصيل.

// 4- يمكن أحيانًا تغيير قيمة المتغير
// لاختبار سلوك البرنامج.

// طريقة الاستخدام:

// 1- نقوم بتحديد (Highlight) المتغير أو الـ Expression
// 2- نضغط Shift + F9
// 3- تفتح نافذة Quick Watch
// 4- تظهر النتيجة مباشرة

// مثال:

// int a = 10;
// int b = 20;

// نحدد:
// a + b

// ثم Shift + F9

// النتيجة:
// 30

// تُستخدم من أجل:
// - اختبار سريع
// - فحص الـ Expressions
// - اكتشاف الأخطاء بسرعة أثناء الـ Debugging

//---------------------------------------------

#include<iostream>
using namespace std;
int MySum(int a, int b)
{
	int s = 0;
	s = a + b;
	return s;
}
int main()
{
	int arr1[5] = { 200,100,50,25,30 };
	int a, b, c;
	a = 10;
	b = 20;
	a++;
	++b;
	c = a + b;
	cout << a << endl;
	cout << b << endl;
	cout << c << endl;
	for (int i = 1; i <= 5; i++)
	{
		cout << i << endl;
		a = a + a * i;
	}
	c = MySum(a, b);
	cout << c;
	return 0;
	}